Revit 2027 API
ParameterTypeId.RbsElecEditCircuitNamingSettingsParam Property
 "Circuit Naming Settings"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecEditCircuitNamingSettingsParam { get; }
Public Shared ReadOnly Property RbsElecEditCircuitNamingSettingsParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecEditCircuitNamingSettingsParam {
	ForgeTypeId^ get ();
}
static member RbsElecEditCircuitNamingSettingsParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace